In [1]:
pip install mysql-connector-python # type: ignore

Requirement already satisfied: mysql-connector-python in /opt/anaconda3/lib/python3.12/site-packages (9.0.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector # type: ignore
 
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password= "7@u*sqJX"   #REPLACE THIS WITH THE PASSWORD YOU SET
)
 
print(mydb)
 
if mydb.is_connected():
    print("CONNECTION SUCCESSFUL")

<mysql.connector.connection_cext.CMySQLConnection object at 0x104b68b30>
CONNECTION SUCCESSFUL

In [19]:
#create a database
mycursor = mydb.cursor()

#mycursor.execute("CREATE DATABASE data1050f24")

In [20]:
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASES")

for x in mycursor:
  print(x)

('data1050f24',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [41]:
#create a table
mycursor = mydb.cursor()
#mycursor.execute("CREATE TABLE data1050F24.department (dept_name VARCHAR(128) PRIMARY KEY, building VARCHAR(255), budget INT)")

In [45]:
mycursor = mydb.cursor()
#mycursor.execute("CREATE TABLE data1050F24.student (ID VARCHAR(128) PRIMARY KEY, name VARCHAR(255), dept_name VARCHAR(128), tot_cred DECIMAL(3,2))")

In [47]:
mycursor = mydb.cursor()
#mycursor.execute("CREATE TABLE data1050F24.instructor (ID VARCHAR(128) PRIMARY KEY, name VARCHAR(255), dept_name VARCHAR(128), salary INT)")

In [49]:
query = ('ALTER TABLE data1050F24.student ADD foreign key(dept_name) references data1050F24.department(dept_name)')
mycursor.execute(query)

In [51]:
query = ('ALTER TABLE data1050F24.instructor ADD foreign key(dept_name) references data1050F24.department(dept_name)')
mycursor.execute(query)

In [53]:
#connect to a specific database
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password= "7@u*sqJX", #REPLACE THIS WITH YOUR PASSWORD 
  database = "data1050f24" #connecting to testDatabase
)

In [55]:
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('department',)
('instructor',)
('student',)

In [57]:
import pandas as pd # type: ignore

In [59]:
pip install fsspec # type: ignore

Requirement already satisfied: fsspec in /opt/anaconda3/lib/python3.12/site-packages (2024.3.1)
Note: you may need to restart the kernel to use updated packages.

In [60]:
#point the path to where in your hard drive you have stored the file department.csv
data = pd.read_csv("department.csv")

In [65]:
for i,row in data.iterrows():
            sql = "INSERT INTO department VALUES (%s,%s,%s)"
            #mycursor.execute(sql, tuple(row))
            print("Record inserted")
            # the connection is not autocommitted by default, so we 
            # must commit to save our changes
            mydb.commit()

Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted

In [67]:
query = "SELECT * from department"
mycursor.execute(query)

In [69]:
for x in mycursor:
    print(x)

('AppMath', 'Pembroke', 1000525)
('CompSci', 'CIT', 4000000)
('DSI', 'Angell', 750000)
('Econ', 'Watson', 1230000)
('English', 'Litereria', 1389400)
('Math', 'Pembroke', 999785)
('Philosophy', 'Athenia', 300000)
('Psychology', 'Skinner', 1223350)
('Sociology', 'Watson', 789000)

In [71]:
#point the path to where in your hard drive you have stored the file department.csv
data = pd.read_csv("student.csv")
data.head()

     ID         name   dept_name  tot_cred
0  1238   John Smith         DSI         4
1  1645     Jane Doe  Philosophy         9
2  1888  Chuning Liu     CompSci         5
3  1970  Stan Ambani        Econ         0
4  1845    Jane Chen         DSI         2

In [73]:
data.dtypes

ID            int64
name         object
dept_name    object
tot_cred      int64
dtype: object

In [77]:
for i,row in data.iterrows():
            sql = "INSERT INTO student VALUES (%s,%s,%s, %s)"
            #mycursor.execute(sql, tuple(row))
            print("Record inserted")
            # the connection is not autocommitted by default, so we 
            # must commit to save our changes
            mydb.commit()

Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted

In [79]:
query = "SELECT * from student"
mycursor.execute(query)

In [81]:
for x in mycursor:
    print(x)

('1122', 'Julia Rodriguez', 'AppMath', Decimal('8.00'))
('1221', 'Ivan Petrov', 'Psychology', Decimal('9.00'))
('1238', 'John Smith', 'DSI', Decimal('4.00'))
('1298', 'Marvel Comic', 'Psychology', Decimal('6.00'))
('1333', 'Mukesh Modi', 'DSI', Decimal('7.00'))
('1444', 'Suresh Verma', 'English', Decimal('4.00'))
('1455', 'Molly Bloom', 'English', Decimal('5.00'))
('1645', 'Jane Doe', 'Philosophy', Decimal('9.00'))
('1845', 'Jane Chen', 'DSI', Decimal('2.00'))
('1881', 'Holly Zheng', 'Sociology', Decimal('5.00'))
('1888', 'Chuning Liu', 'CompSci', Decimal('5.00'))
('1934', 'Boris Pasternak', 'Math', Decimal('3.00'))
('1970', 'Stan Ambani', 'Econ', Decimal('0.00'))
('1999', 'Peter Lynch', 'AppMath', Decimal('6.00'))
('2142', 'Sabrina Zhou', 'DSI', Decimal('4.00'))
('2143', 'Maya Abdul', 'Sociology', Decimal('3.00'))
('2144', 'Karim Shiny', 'English', Decimal('5.00'))
('2145', 'Valentino Love', 'Psychology', Decimal('4.00'))
('2946', 'Steve Brown', 'Math', Decimal('9.00'))
('3303', 'Jane Lynch', 'Philosophy', Decimal('3.00'))

In [83]:
#point the path to where in your hard drive you have stored the file department.csv
data = pd.read_csv("instructor.csv")
data.head()

    ID           name   dept_name  salary
0  111      Joe Smith         DSI  120000
1  112     Ying Zheng     CompSci  220000
2  113  Sunil Agarwal     AppMath   99000
3  114    Jennifer Lo     English   86000
4  115    Taylor Slow  Psychology   90000

In [87]:
for i,row in data.iterrows():
            sql = "INSERT INTO instructor VALUES (%s,%s,%s, %s)"
            #mycursor.execute(sql, tuple(row))
            print("Record inserted")
            # the connection is not autocommitted by default, so we 
            # must commit to save our changes
            mydb.commit()

Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted
Record inserted

In [89]:
query = "SELECT * from instructor"
mycursor.execute(query)

In [91]:
for x in mycursor:
    print(x)

('111', 'Joe Smith', 'DSI', 120000)
('112', 'Ying Zheng', 'CompSci', 220000)
('113', 'Sunil Agarwal', 'AppMath', 99000)
('114', 'Jennifer Lo', 'English', 86000)
('115', 'Taylor Slow', 'Psychology', 90000)
('116', 'Friar Driver', 'English', 88000)
('117', 'Carmen Herman', 'DSI', 150000)
('118', 'Calista Holistic', 'CompSci', 123000)
('119', 'Rashid Irani', 'Psychology', 101000)